# October 28th - Pandas library

In [1]:
import pandas as pd
import numpy as np

Базавая структура данных в Pandas - dataframe (Series)
Series как тот же NumPy массив

In [7]:
df = pd.DataFrame([['Anna', 23, 3],
                  ['Ivan', 36, 12],
                  ['Yan', 33, 10],
                  ['Vladimir', 25, 7],
                  ['Lisa', 27, 7],
                  ['Alexnder', 32, None]])

In [8]:
df

          0   1     2
0      Anna  23   3.0
1      Ivan  36  12.0
2       Yan  33  10.0
3  Vladimir  25   7.0
4      Lisa  27   7.0
5  Alexnder  32   NaN

In [10]:
df[2]

0     3.0
1    12.0
2    10.0
3     7.0
4     7.0
5     NaN
Name: 2, dtype: float64

# Индексация

In [23]:
df.columns = ['name', 'age', 'expr']
df

       name  age  expr
0      Anna   23   3.0
1      Ivan   36  12.0
2       Yan   33  10.0
3  Vladimir   25   7.0
4      Lisa   27   7.0
5  Alexnder   32   NaN

In [12]:
df.iloc[1]

name      Ivan
age         36
height    12.0
Name: 1, dtype: object

In [13]:
df.iloc[1,2]

np.float64(12.0)

In [14]:
df.iloc[:,0]

0        Anna
1        Ivan
2         Yan
3    Vladimir
4        Lisa
5    Alexnder
Name: name, dtype: object

In [15]:
df.iloc[1:3,:]

   name  age  height
1  Ivan   36    12.0
2   Yan   33    10.0

In [16]:
df[0]

KeyError: 0

In [17]:
df['name']

0        Anna
1        Ivan
2         Yan
3    Vladimir
4        Lisa
5    Alexnder
Name: name, dtype: object

In [24]:
df.loc[1:4, 'name':'expr']

       name  age  expr
1      Ivan   36  12.0
2       Yan   33  10.0
3  Vladimir   25   7.0
4      Lisa   27   7.0

In [25]:
df.index = df.name
df

              name  age  expr
name
Anna          Anna   23   3.0
Ivan          Ivan   36  12.0
Yan            Yan   33  10.0
Vladimir  Vladimir   25   7.0
Lisa          Lisa   27   7.0
Alexnder  Alexnder   32   NaN

In [27]:
df.loc['Anna', 'ageb']

np.int64(23)

In [29]:
df.loc['Vladimir' : 'Alexnder', 'expr']

name
Vladimir    7.0
Lisa        7.0
Alexnder    NaN
Name: expr, dtype: float64

In [30]:
df.loc['Vladimir' : 'Alexnder', ['age', 'expr']]

          age  expr
name
Vladimir   25   7.0
Lisa       27   7.0
Alexnder   32   NaN

# Характеристика датафреймов

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Anna to Alexnder
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   expr    5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 364.0+ bytes

In [33]:
df.shape

(6, 3)

In [34]:
arr = np.random.rand(888, 4)
df = pd.DataFrame(arr, columns=list('ABCD'))

In [36]:
print(df)

            A         B         C         D
0    0.676114  0.860238  0.279983  0.109350
1    0.013430  0.778155  0.584120  0.178081
2    0.015484  0.352645  0.700957  0.449931
3    0.542648  0.746440  0.182675  0.074262
4    0.886396  0.892314  0.031164  0.833858
..        ...       ...       ...       ...
883  0.115645  0.360677  0.227004  0.001310
884  0.223807  0.504874  0.781060  0.072311
885  0.511315  0.589509  0.686922  0.962986
886  0.575234  0.843758  0.889065  0.424605
887  0.499501  0.359543  0.490371  0.311716

[888 rows x 4 columns]

In [40]:
df.head(11)

           A         B         C         D
0   0.676114  0.860238  0.279983  0.109350
1   0.013430  0.778155  0.584120  0.178081
2   0.015484  0.352645  0.700957  0.449931
3   0.542648  0.746440  0.182675  0.074262
4   0.886396  0.892314  0.031164  0.833858
5   0.147788  0.019944  0.964455  0.187963
6   0.524090  0.441867  0.409985  0.291723
7   0.718322  0.026693  0.555204  0.519865
8   0.633095  0.053155  0.021106  0.675913
9   0.584218  0.851967  0.886963  0.629739
10  0.902108  0.111463  0.101656  0.704259

In [41]:
df.tail()

            A         B         C         D
883  0.115645  0.360677  0.227004  0.001310
884  0.223807  0.504874  0.781060  0.072311
885  0.511315  0.589509  0.686922  0.962986
886  0.575234  0.843758  0.889065  0.424605
887  0.499501  0.359543  0.490371  0.311716

In [42]:
df.tail(11)

            A         B         C         D
877  0.885961  0.722329  0.746194  0.738848
878  0.526983  0.562537  0.940256  0.098473
879  0.859896  0.828944  0.311109  0.844807
880  0.031662  0.566302  0.561513  0.107932
881  0.365285  0.752433  0.215073  0.607903
882  0.233912  0.118611  0.511646  0.576797
883  0.115645  0.360677  0.227004  0.001310
884  0.223807  0.504874  0.781060  0.072311
885  0.511315  0.589509  0.686922  0.962986
886  0.575234  0.843758  0.889065  0.424605
887  0.499501  0.359543  0.490371  0.311716

In [44]:
df.sample(5)

            A         B         C         D
770  0.140217  0.846898  0.015361  0.058488
405  0.502151  0.798667  0.724327  0.299925
147  0.381322  0.237459  0.745355  0.970306
822  0.779243  0.550237  0.601391  0.008796
352  0.790402  0.809726  0.850528  0.828664

# Вывод описательных статистик

In [46]:
df.describe()

                A           B           C           D
count  888.000000  888.000000  888.000000  888.000000
mean     0.478443    0.490707    0.493229    0.518553
std      0.293031    0.291221    0.285867    0.282823
min      0.000311    0.001087    0.001263    0.000426
25%      0.222038    0.235183    0.251052    0.282685
50%      0.476053    0.496599    0.490280    0.538043
75%      0.738506    0.749499    0.734402    0.763672
max      0.999325    0.999321    0.999670    0.999759

In [49]:
# Метод Транспорирования (Столбцы стали строками)
df.describe().T

   count      mean       std       min       25%       50%       75%       max
A  888.0  0.478443  0.293031  0.000311  0.222038  0.476053  0.738506  0.999325
B  888.0  0.490707  0.291221  0.001087  0.235183  0.496599  0.749499  0.999321
C  888.0  0.493229  0.285867  0.001263  0.251052  0.490280  0.734402  0.999670
D  888.0  0.518553  0.282823  0.000426  0.282685  0.538043  0.763672  0.999759